Repository: ntdoJanneck/multiply_me
Catalog: lib/l10n/app_*.arb
Languages: de

# appTitle
source: QuickMaths Beta
de: MultiplyMe

# creditsMessage
source: Developed by Janneck
de: Entwickelt von Janneck

# singleTableTitle
source: Single Multiplication Table
de: Einzelne Einmaleins Reihe

# singleTableDescription
source: Practise a single multiplication table
de: Eine einzelne Einmaleins Reihe üben.

# multipleTableTitle
source: Multiple Multiplication Tables
de: Mehrere Einmaleins Reihen

# multipleTableDescription
source: Practise multiple multiplication tables
de: Mehrere Einmaleins Reihen üben.

# shortcutTenTitle
source: Tables 1 to 10
de: Zahlenreihen 1 bis 10

# shortcutTenDescription
source: Practise all tables from 1 to 10.
de: Die Zahlenreihen 1 bis 10 jeweils von 1 bis 10 üben.

# practiseTitle
source: Practise
de: Üben

# statisticsTitle
source: Statistics
de: Statistiken

# settingsTitle
source: Settings
de: Einstellungen

# statisticsErrorMessage
source: Statistics will be a feature in a future version.
de: Statistiken sind für eine spätere Version geplant.

# multiplicationTableTable
source: Table
de: Zahlenreihe

# multiplicationTableRangeA
source: Range A
de: Start

# multiplicationTableRangeB
source: Range B
de: Ende

# multiplicationTableRandomize
source: Randomize Order
de: Zufällige Reihenfolge

# multiplicationTableErrorHeadline
source: Hold onâ€¦
de: Moment mal…

# multiplicationTableErrorFillInAll
source: You have to fill in all 3 fields!
de: Du musst alle 3 Felder ausfüllen!

# inProgressProgressDisplay
source: Task {current} of {total}
de: Aufgabe {current} von {total}

# resultsHeadline
source: Results
de: Ergebnisse

# resultsTimeDisplay
source: Time: {duration}
de: Zeit: {duration}

# multiplicationTableAddTable
source: Add table
de: Zahlenreihe hinzufügen

# multiplicationTableErrorNotEnoughInformation
source: You did not give all required information!
de: Du hast nicht alle nötigen Informationen eingegeben!

# multiplicationTableHeadline
source: Multiplication Tables
de: Einmaleins Reihen

# multiplicationTableErrorDidNotInputNumber
source: You did not input a number!
de: Du hast keine Zahl angegeben!

# multiplicationTableErrorAlreadyAddedTable
source: You already added that table!
de: Diese Reihe hast du schon hinzugefügt!

# inProgressErrorDidNotAnswer
source: You did not give an answer!
de: Du hast keine Antwort gegeben!

# inProgressConfirmQuitMessage
source: Do you really want to quit?
de: Möchtest du wirklich abbrechen?

# resultsHeaderMessage
source: Well done! See your results below.
de: Gut gemacht! Die Ergebnisse siehst du unten.

# resultsTotalCorrectMessage
source: Correct answers: {totalCorrect} of {total} ({percentage}%}
de: Korrekte Antworten: {totalCorrect} von {total} ({percentage}%)

# resultsTotalWrongMessage
source: Wrong answers: {totalWrong} of {total} ({percentage}%}
de: Falsche Antworten: {totalWrong} von {total} ({percentage}%)

# dialogYes
source: Yes
de: Ja

# dialogNo
source: No
de: Nein

# settingsDeleteStatisticsDataTitle
source: Delete statistics data
de: Statistiken löschen

# settingsDeleteStatisticsDataConfirmationMessage
source: Do you really want to delete all your statistics data? This cannot be undone.
de: Möchtest du wirklich deine Statistiken löschen? Dieser Schritt kann nicht rückgängig gemacht werden.
